In [14]:
harry_potter = {
    "director": ["Chris Columbus", 'Alfonso Cuarón', 'David Yates'],
    "chapter": ["The Philosopher's Stone", 'The Prisoner of Azkaban', 'The Order of the Phoenix'],
    "year": ["2001", '2004', '2007']
}

In [15]:
import pandas as pd          # importing pandas library

In [16]:
df = pd.DataFrame(harry_potter)          # passing the harry potter dictionary in DataFrame
df        # printing the DataFrame

         director                   chapter  year
0  Chris Columbus   The Philosopher's Stone  2001
1  Alfonso Cuarón   The Prisoner of Azkaban  2004
2     David Yates  The Order of the Phoenix  2007

In [17]:
df.loc[2]           # grabbing row with index label

director                 David Yates
chapter     The Order of the Phoenix
year                            2007
Name: 2, dtype: object

In [18]:
df.loc[2] = ['David Yates', 'The Deathly Hallows', 2010]        # changing rows values
df

         director                  chapter  year
0  Chris Columbus  The Philosopher's Stone  2001
1  Alfonso Cuarón  The Prisoner of Azkaban  2004
2     David Yates      The Deathly Hallows  2010

In [20]:
df.loc[2, ['chapter', 'year']] = ['The Order of the Phoenix', '2007']   # beneficial for a large number of columns
df

         director                   chapter  year
0  Chris Columbus   The Philosopher's Stone  2001
1  Alfonso Cuarón   The Prisoner of Azkaban  2004
2     David Yates  The Order of the Phoenix  2007

In [21]:
df.loc[2, 'chapter'] = 'The Deathly Hallows'        # changing a single value
df     # printing

         director                  chapter  year
0  Chris Columbus  The Philosopher's Stone  2001
1  Alfonso Cuarón  The Prisoner of Azkaban  2004
2     David Yates      The Deathly Hallows  2007

In [22]:
df.at[2, 'chapter'] = 'The Order of Phoenix'         # at indexer
df

         director                  chapter  year
0  Chris Columbus  The Philosopher's Stone  2001
1  Alfonso Cuarón  The Prisoner of Azkaban  2004
2     David Yates     The Order of Phoenix  2007

In [23]:
filt = (df['year'] == '2007')       # This is the filter that we are looking for
df[filt]         # applying filter to a data frame

      director               chapter  year
2  David Yates  The Order of Phoenix  2007

In [24]:
filt = (df['year'] == '2007')    # filter
df[filt]['chapter']      # accessing chapter from data frame that just returned

2    The Order of Phoenix
Name: chapter, dtype: object

In [29]:
filt = (df['year'] == '2007')    
df.loc[filt, 'chapter'] = 'The Deathly Hallows'
df

         director                  chapter  year
0  Chris Columbus  The Philosopher's Stone  2001
1  Alfonso Cuarón  The Prisoner of Azkaban  2004
2     David Yates      The Deathly Hallows  2007

In [30]:
df['chapter'].str.lower()      # lowering the values

0    the philosopher's stone
1    the prisoner of azkaban
2        the deathly hallows
Name: chapter, dtype: object

In [31]:
df['chapter'] = df['chapter'].str.lower()
df

         director                  chapter  year
0  Chris Columbus  the philosopher's stone  2001
1  Alfonso Cuarón  the prisoner of azkaban  2004
2     David Yates      the deathly hallows  2007

In [32]:
df['chapter'].apply(len)

0    23
1    23
2    19
Name: chapter, dtype: int64

In [33]:
def update_chapter(chapter):           # writing a function
    return chapter.upper()

In [34]:
df['chapter'].apply(update_chapter)    # applying a function

0    THE PHILOSOPHER'S STONE
1    THE PRISONER OF AZKABAN
2        THE DEATHLY HALLOWS
Name: chapter, dtype: object

In [35]:
df['chapter'] = df['chapter'].apply(update_chapter)     # set apply series to a chapter column
df

         director                  chapter  year
0  Chris Columbus  THE PHILOSOPHER'S STONE  2001
1  Alfonso Cuarón  THE PRISONER OF AZKABAN  2004
2     David Yates      THE DEATHLY HALLOWS  2007

In [36]:
df['chapter'] = df['chapter'].apply(lambda x: x.lower())      # using lambda function
df

         director                  chapter  year
0  Chris Columbus  the philosopher's stone  2001
1  Alfonso Cuarón  the prisoner of azkaban  2004
2     David Yates      the deathly hallows  2007

In [37]:
df.applymap(len)        # applymap() function

   director  chapter  year
0        14       23     4
1        14       23     4
2        11       19     4

In [38]:
df.applymap(str.lower)            # lowercase suing applymaop function

         director                  chapter  year
0  chris columbus  the philosopher's stone  2001
1  alfonso cuarón  the prisoner of azkaban  2004
2     david yates      the deathly hallows  2007

In [40]:
df['chapter'].map({"the philosopher's stone": "the chamber of secrets", "the deathly hallows": "the half-blood prince"})

0    the chamber of secrets
1                       NaN
2     the half-blood prince
Name: chapter, dtype: object

In [41]:
df['chapter'].replace({"the philosopher's stone": "the chamber of secrets", "the deathly hallows": "the half-blood prince"})

0     the chamber of secrets
1    the prisoner of azkaban
2      the half-blood prince
Name: chapter, dtype: object

In [44]:
df['chapter'] = df['chapter'].replace({"the philosopher's stone": "the chamber of secrets",
                                       "the deathly hallows": "the half-blood prince"})
df

         director                  chapter  year
0  Chris Columbus   the chamber of secrets  2001
1  Alfonso Cuarón  the prisoner of azkaban  2004
2     David Yates    the half-blood prince  2007